      *%METADATA                                                       *
      * %TEXT Prototype for printf                                     *
      *%EMETADATA 
      Dcl-PR printf Int(10) extproc('printf');
        input Pointer value options(*string);
      End-PR;