**free
// printf
// Print to standard out
// @param String value pointer
Dcl-PR printf Int(10) extproc('printf');
  input Pointer value options(*string);
End-PR;